app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", ""], ["created_at", Mon, 17 Jun 2013 01:49:31 UTC +00:00], ["question_id", 1], ["updated_at", Mon, 17 Jun 2013 01:49:31 UTC +00:00]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.build(params[:answer])
    @answer.user = current_user
    @answer.save