proyecto1/app/views/questions/show.html.erb


<% @question.comment_qs.each do |comment_q| %>
---
SELECT "comment_qs".* FROM "comment_qs" WHERE "comment_qs"."question_id" = 3


<% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = 1